#include "Bat.h"
#include <sstream>
#include <cstdlib>
#include <SFML/Graphics.hpp>

int main()
{
	// Створюємо об'єкт VideoMode
	VideoMode vm(1920, 1090);
	// Створюємо та відкриваємо вікно для гри в повноекранному режимі
	RenderWindow window(vm, "Pong", Style::Fullscreen);
	int score = 0; // Ініціалізуємо змінну для рахунку
	int lives = 3; // Ініціалізуємо змінну для життів

	// Створюємо ракетку у нижній центральній частині екрану
	Bat bat(1920 / 2, 1080 - 20); // Ракетка розташована на 20 пікселів вище нижнього краю
	// Тут буде стоврений м'яч

	// Створюємо текстовий об'єкт HUD
	Text hud;
	// Крутий ретрошрифт
	Font font;
	font.loadFromFile("fonts/DS-DIGIT.ttf");
	// Встановлюємо шрифт
	hud.setFont(font);
	// Робимо його великим та красивим
	hud.setCharacterSize(75);
	// Вибираємо колір
	hud.setFillColor(Color::White);
	hud.setPosition(20, 20); // Розміщуємо у верхньому лівому куті

	// Таймер для керування часом
	Clock clock;
	while (window.isOpen())
	{
		/*
Обробка введення гравця
**************************************
**************************************
**************************************
*/
/*
Оновлення ракетки, м'яча та HUD
**************************************
**************************************
**************************************
*/
/*
Відображення ракетки, м'яча та HUD
**************************************
**************************************
**************************************
*/
	}
	return 0; 

}